Revit 2026 API

# SelectionChangedEventArgs Methods

---

The SelectionChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDocument | Returns the document associated with this event. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReferences | Returns the references that are currently selected. |
|  | GetSelectedElements | Returns ElementIds of selected elements. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SelectionChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace